# Data Input and Output
+ CSV
+ Excel
+ HTML
+ SQL

### CSV

In [1]:
import pandas as pd

In [2]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
df = pd.read_csv('example.csv')

In [4]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df.to_csv('my_output.csv', index=False)

### Excel

In [10]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1', index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
df.to_excel('my_excel_book.xlsx',sheet_name='NewSheet')